---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BIMExportOptions Properties
BIMExportOptions Class See Also Send Feedback
---

The BIMExportOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ViewId | The element id of the 3D view to export. InvalidElementId by default. |

# See Also

BIMExportOptions Class

Autodesk.Revit.DB Namespace